module.exports = {
  subscriptionTitle: "Темплейт технического задания",
  subscriptionSubTitle: `Мы уверены, что правильно составленное ТЗ повышает шансы на успех
  проекта. Поэтому с радостью делимся тем, что работает для нас!`,
  firstName: "Имя",
  subscriptionPrivacy: `<p>
  Отправляя эту форму, вы соглашаетесь с
  <a href="/">нашей политикой конфиденциальности</a>.
</p>`,
  loadingMessage: "Загрузка...",
  submit: "Отправить",
  portfolioLabel: "Портфолио",
  prevWork: "Предыдущая работа",
  nextWork: "Сдедующая работа",
  backToWorks: "Вернуться в портфолио",
  loadMoreButton: "Больше",
  noOptionsMessage: "Пусто",
  categoryFilter: "Категория",
  serviceFilter: "Услуга",
  resetFilterButton: "Сбросить фильтры",
  planCardButtonLabel: "Узнать цену",
  whyTitle: "Почему мы?",
  contactTitle: "Напишите нам",
  contactText:
    "Расскажите нам о своём проекте, продукте или идее. Спросите совет или получите полноценную бесплатную консультацию. Узнайте цены, уточните важный вопрос, да что угодно! Мы будем рады с вами познакомиться и помочь.",
}
