module.exports = {
  prevWork: "Попередня робота",
  nextWork: "Наступна робота",
  backToWorks: "Повернутися в портфоліо",
  loadMoreButton: "Більше",
  noOptionsMessage: "Порожньо",
  categoryFilter: "Категорія",
  serviceFilter: "Послуга",
  resetFilterButton: "Скинути фільтри",
  planCardButtonLabel: "Дізнатись ціну",
  whyTitle: "Чому ми?",
  contactTitle: "Напишіть нам",
  contactText:
    "Розкажіть нам про свій проект, продукт або ідеї. Запитайте рада або отримаєте повноцінну безкоштовну консультацію. Дізнайтеся ціни, уточніть важливе питання, та що завгодно! Ми будемо раді співпрацювати з вами познайомитися і допомогти.",
}
