module.exports = {
  subscriptionTitle: "Темплейт технічного завдання",
  subscriptionSubTitle: `Ми впевнені, що правильно складене ТЗ підвищує шанси на успіх
  проекту. Тому з радістю ділимося тим, що працює для нас!`,
  firstName: "Ім'я",
  subscriptionPrivacy: `<p>
  Відправляючи цю форму, ви погоджуєтеся з
  <a href="/">нашою політикою конфіденційності</a>.
</p>`,
  loadingMessage: "Завантаження...",
  submit: "Відправити",
  portfolioLabel: "Портфоліо",
  prevWork: "Попередня робота",
  nextWork: "Наступна робота",
  backToWorks: "Повернутися в портфоліо",
  loadMoreButton: "Більше",
  noOptionsMessage: "Порожньо",
  categoryFilter: "Категорія",
  serviceFilter: "Послуга",
  resetFilterButton: "Скинути фільтри",
  planCardButtonLabel: "Дізнатись ціну",
  whyTitle: "Чому ми?",
  contactTitle: "Напишіть нам",
  contactText:
    "Розкажіть нам про свій проект, продукт або ідею. Запитайте пораду або отримайте повноцінну безплатну консультацію. Дізнайтеся вартість, уточніть важливе питання, та що завгодно! Ми будемо раді з вами познайомитися й допомогти.",
}
