{
  "aboutPageTitle": "О нас",
  "aboutPageForeword": "Всё началось с…",
  "aboutPageBio": "Влада Плотникова и его желания превратить любимое занятие в работу.\n\n Он всегда был музыкантом: первый концерт на венике в 3 года, музыкальная школа вместо футбола, бесконечные уроки сольфеджио (обязательно в субботу утром, когда нормальные дети спят) и юношеский рок-бунт, который потом перерос в проек <a href={{bandcampLink}} rel=nofollow target=_blank>Total-Empty</a>. И хотя Влад получил высшее образование совсем в другой сфере, на «серьёзную» и стабильную работу всё же не пошёл. В решающий момент он выбрал музыку.\n\nИзначально компания VP Production была одним человеком, который создавал музыку и звуковые эффекты, сводил, мастерил, имплементировал звук, общался с клиентами и разбирался в налоговых декларациях. Естественно, что спустя короткое время стало очевидно — действительно крутые вещи выходят только вместе с крутыми людьми. Так и начался путь нашей компании.\n\nСейчас VP Production — это команда, в которой каждый любит своё дело. Будь то создание музыки, звуковой дизайн, голосовое озвучивание, проектный менеджмент или маркетинг — мы не можем этим не заниматься. Поэтому каждый день мы вдохновляем слушателей по обе стороны аудиовизуальных проектов и получаем от этого удовольствие.",
  "aboutTeamTitle": "Наша команда",
  "aboutQuote1": "Мы в первую очередь помогаем, а не продаём.",
  "aboutQuote2": "Мы ведём проекты, когда совпадаем с клиентом в основном видении и принципах работы.",
  "aboutQuote3": "Мы улучшаем всё, что можно улучшить, даже если результат уже принят и оплачен.",
  "aboutWhySectionTitle": "И еще",
  "aboutOurValuesText": "С помощью аудио мы вдохновляем слушателей по обе стороны медиапроектов на новый опыт и раскрытие собственного творческого потенциала.",
  "aboutOurValuesButton": "Наши ценности",
  "aboutContacts": "Расскажите нам о своём проекте, продукте или идее. Спросите совет или получите полноценную <a rel=\"nofollow noopener noreferrer\" target=_blank href={{mailToLink}}>бесплатную консультацию</a>. Узнайте цены, уточните важный вопрос, или, может, вы хотите стать частью нашей команды? Да что угодно! Мы будем рады с вами познакомиться и помочь."
}
