{
  "faqPageTitle": "faq",
  "faqSec1": {
    "title": "Организационные вопросы",
    "questions": [
      {
        "title": "Что нужно, чтобы вы могли начать работу?",
        "content": "Нам нужно сперва познакомиться с вами и вашим проектом. Для этого вы заполняете бриф, а мы проводим для вас <a rel=nofollow noopener noreferrer target=_blank href={{templateLink}}>бесплатную консультацию</a>. Если мы с вами совпадём характерами, останется только составить техническое задание и подписать договор."
      },
      {
        "title": "А что делать, если мой проект под NDA?",
        "content": "<a rel=nofollow noopener noreferrer target=_blank href={{emailLink}}>Напишите нам</a>, мы подпишем соответствующие документы и сможем свободно всё обсудить."
      },
      {
        "title": "Вы делаете тестовые задания?",
        "content": "Конечно, мы выполняем тестовые задания, но по стандартной стоимости услуг.\n\nМы считаем, что формат бесплатного тестового задания заставляет исполнителя фокусироваться не на потребностях проекта, а на том, как впечатлить заказчика. Чаще всего результаты таких заданий не объективны и это в будущем может вредить всему проекту.\n\nТем не менее, мы готовы сделать исключение в том случае, если перед нами интересный инди проект, который обращается к нам за помощью и круто себя презентует. Если это о вас — <a rel=nofollow noopener noreferrer target=_blank href={{emailLink}}>смело пишите</a>!"
      },
      {
        "title": "Кто составляет техническое задание на проект?",
        "content": "В идеале ТЗ на проект составляет клиент. В таком случае у обеих сторон изначально максимально чёткие ожидания от результатов сотрудничества. Это помогает выбрать нужный вектор и закладывает прочный фундамент для успешной работы.\n\nМы же с радостью поделимся с вами <link1>проверенным темплейтом технического</link1> задания и при необходимости поможем с заполнением."
      },
      {
        "title": "Как организован остальной процесс работы?",
        "content": "В зависимости от выбранной услуги процесс может варьироваться, хотя основные 6 стадий остаются неизменными: знакомство, подготовка, запуск, продакшн, приём проекта и его дальнейшая поддержка.\n\nКак организован процесс работы для каждой из наших услуг, можно подробно прочитать на страницах <a href={{musicComposingLink}}>создание музыки</a>, <a href={{soundDesignLink}}>звуковой дизайн</a>, <a href={{audioBrandingLink}}>аудиобрендинг</a> и <a href={{voiceCastingLink}}>голосовое озвучивание</a>."
      }
    ]
  },
  "faqSec2": {
    "title": "Финансовые вопросы",
    "questions": [
      {
        "title": "Вы работаете по предоплате?",
        "content": "Да, мы работаем по предоплате. Чаще всего аванс — это 50 % суммы, но в некоторых случаях нужна полная предоплата."
      },
      {
        "title": "В каких случаях предоплата 100 %?",
        "content": "Полная предоплата нужна при любом заказе голосового озвучивания и если вы выберете пакет S.O.S для создания музыки."
      },
      {
        "title": "Как можно оплатить ваши услуги?",
        "content": "Мы принимаем оплату за оказанные услуги только на расчётный счёт физического лица предпринимателя (ФЛП) или на счёт Payoneer."
      }
    ]
  },
  "faqSec3": {
    "title": "Юридические вопросы",
    "questions": [
      {
        "title": "Есть ли у вас договор?",
        "content": "Да, с каждым клиентом мы заключаем договор о предоставлении услуг. Он у нас крутой и крафтовый — всё благодаря команде юристов, с которой мы сотрудничаем."
      },
      {
        "title": "Какие права на результат я получу?",
        "content": "На созданные нами звуковые эффекты, голосовое озвучивание и элементы аудио бренда мы по умолчанию передаём вам исключительные материальные права интеллектуальной собственности, конечно, с одним условием — после оплаты наших услуг.\n\nНа созданные нами музыкальные композиции мы по умолчанию передаём вам имущественные права интеллектуальной собственности, с ограничением возможности свободной их перепродажи и перевыпуска, вне оговоренного нами проекта, а также получения монетизации со стриминговых сервисов и маркетплейсов.\n\nПри необходимости мы можем передать вам все исключительные имущественные права интеллектуальной собственности без каких-либо ограничений, но это следует оговаривать отдельно и в таком случае общая стоимость проекта будет выше."
      },
      {
        "title": "Почему вы просто не передаёте все исключительные права на музыку?",
        "content": "Иногда саундтреки становятся дополнительным средством монетизации проекта и источником сверхприбыли. Мы считаем справедливым, что в подобных случаях композитор имеет право на дополнительную компенсацию."
      }
    ]
  },
  "faqPageContactText": "Не нашли ответ на важный для вас вопрос? Обязательно задайте его нам – мы будем рады познакомиться с вами и помочь."
}
