{
  "aboutPageTitle": "About us",
  "aboutPageForeword": "It all started with…",
  "aboutPageBio": "Vlad Plotnikov and his desire to turn his favorite pastime into work.\n\n He was always a musician: the first concert on a broom at three years old, a music school instead of football, endless solfeggio lessons, and a youthful rock riot, which later became the <a href={{bandcampLink}} rel=nofollow target=_blank>Total-Empty</a>. And although Vlad received his higher education in a completely different field, he still did not go for a «serious» and stable job. At the decisive moment, he chose the music.\n\nInitially, VP Production was one person who created music and sound effects, mixed, mastered, implemented sound, communicated with customers, and dealt with taxes. Naturally, after a short time, it became apparent: cool things could be done only with cool people. And so began the path of our company.\n\nNow VP Production is a team where everyone loves his or her job. Whether it is music composing, sound design, voice acting, project management, or marketing — we cannot imagine our lives without it. That is why every day we inspire listeners on both sides of audiovisual projects and enjoy it.",
  "aboutTeamTitle": "Audio Team",
  "aboutQuote1": "We primarily help, not sell.",
  "aboutQuote2": "We work on projects when we match with a client in the vision and principles of work.",
  "aboutQuote3": "We improve everything that can be improved, even if the result is already paid for and accepted.",
  "aboutWhySectionTitle": "Also",
  "aboutOurValuesText": "Using audio, we inspire listeners on both sides of media projects to live new experiences and discover their creative potential.",
  "aboutOurValuesButton": "Our values",
  "aboutContacts": "Tell us about your project, product, or idea. Ask for advice, or get a full <a rel=\"nofollow noopener noreferrer\" target=_blank href={{mailToLink}}>free consultation</a>. Find out the rates, clarify a vital question, or maybe you want to become part of our team? Anything you want! We will be happy to get to know you and help."
}
