{
  "aboutPageTitle": "Про нас",
  "aboutPageForeword": "Усе почалося з…",
  "aboutPageBio": "Влада Плотнікова та його бажання перетворити улюблене заняття на роботу.\n\n Він завжди був музикантом: перший концерт на вінику в 3 роки, музична школа замість футболу, нескінченні уроки сольфеджіо (обов’язково в суботу вранці, коли нормальні діти сплять) і юнацький рок-бунт, який потім переріс у проєкт <a href={{bandcampLink}} rel=nofollow target=_blank>Total-Empty</a>. І хоча Влад здобув вищу освіту зовсім в іншій сфері, на «серйозну» і стабільну роботу все ж не пішов. У вирішальний момент він вибрав музику.\n\nСпочатку компанія VP Production була однією людиною. Влад створював музику і звукові ефекти, зводив, робив мастеринг, імплементував звук, спілкувався з клієнтами й розбирався в податкових деклараціях. Звичайно, що вже за короткий час стало очевидним — дійсно круті речі виходять тільки разом із крутими людьми. Так і почався шлях нашої компанії.\n\nЗараз VP Production — це команда, в якій кожен любить свою справу. І зовсім неважливо, про що йде мова: створення музики, звуковий дизайн, голосове озвучення, проєктний менеджмент або маркетинг — ми не можемо цим не займатися. Тому кожен день ми надихаємо слухачів по обидві сторони аудіовізуальних проєктів і отримуємо від цього задоволення.",
  "aboutTeamTitle": "Наша команда",
  "aboutQuote1": "Ми насамперед допомагаємо, а не продаємо.",
  "aboutQuote2": "Ми ведемо проєкти, коли збігаємося з клієнтом в основному баченні і принципах роботи.",
  "aboutQuote3": "Ми покращуємо все, що можна поліпшити, навіть якщо результат вже прийнятий і оплачений.",
  "aboutWhySectionTitle": "І ще",
  "aboutOurValuesText": "Завдяки аудіо ми надихаємо слухачів по обидві сторони аудіовізуальних проєктів на новий досвід і розкриття власного творчого потенціалу.",
  "aboutOurValuesButton": "Наші цінності",
  "aboutContacts": "Розкажіть нам про свій проєкт, продукт або ідею. Запитайте пораду або отримайте повноцінну <a rel=\"nofollow noopener noreferrer\" target=_blank href={{mailToLink}}>безплатну консультацію</a>. Дізнайтеся вартість, уточніть важливе питання, чи, може, ви хочете стати частиною нашої команди? Та що завгодно! Ми будемо раді з вами познайомитися й допомогти."
}
