{
  "faqPageTitle": "faq",
  "faqSec1": {
    "title": "Організаційні питання",
    "questions": [
      {
        "title": "Що потрібно аби ви могли почати роботу?",
        "content": "Спершу нам потрібно познайомитися з вами і вашим проєктом. Для цього ви заповнюєте бриф, а ми проводимо для вас <a rel=nofollow noopener noreferrer target=_blank href={{templateLink}}>безплатну консультацію</a>. Якщо ми з вами збігатемося характерами, залишиться тільки скласти технічне завдання й підписати договір."
      },
      {
        "title": "А що робити, якщо мій проєкт під NDA?",
        "content": "<a rel=nofollow noopener noreferrer target=_blank href={{emailLink}}>Напишіть нам</a>, ми підпишемо відповідні документи і зможемо вільно все обговорити."
      },
      {
        "title": "Ви робите тестові завдання?",
        "content": "Звичайно, ми виконуємо тестові завдання, але за стандартною вартістю послуг.\n\nМи вважаємо, що формат безоплатного тестового завдання змушує виконавця фокусуватися не на потребах проєкту, а на тому, як вразити замовника. Найчастіше результати таких завдань не об’єктивні й це в майбутньому може шкодити всьому проєкту.\n\nПроте, ми готові зробити виняток у тому випадку, якщо перед нами цікавий інді проєкт, який звертається до нас по допомогу і круто себе презентує. Якщо це про вас — <a rel=nofollow noopener noreferrer target=_blank href={{emailLink}}>сміливо пишіть</a>!"
      },
      {
        "title": "Хто складає технічне завдання на проєкт?",
        "content": "Ідеально, коли ТЗ на проєкт складає клієнт. У такому випадку в обох сторін від самого початку формуються максимально чіткі очікування від результатів співпраці. Це допомагає обрати потрібний вектор і закладає міцний фундамент для успішної роботи.\n\nМи з радістю поділимося з вами <link1>перевіреним темплейтом технічного завдання</link1> й за необхідності допоможемо з заповненням."
      },
      {
        "title": "Як організована решта процесу роботи?",
        "content": "Залежно від обраної послуги процес може варіюватися, хоча основні 6 стадій залишаються незмінними: знайомство, підготовка, запуск, продакшн, прийом проєкту і його подальша підтримка.\n\nЯк організований процес роботи для кожної з наших послуг, можна детально прочитати на сторінках <a href={{musicComposingLink}}>створення музики</a>, <a href={{soundDesignLink}}>звуковий дизайн</a>, <a href={{audioBrandingLink}}>аудіобрендинг</a> і <a href={{voiceCastingLink}}>голосове озвучення</a>."
      }
    ]
  },
  "faqSec2": {
    "title": "Фінансові питання",
    "questions": [
      {
        "title": "Ви працюєте за передоплатою?",
        "content": "Так, ми працюємо за передоплатою. Найчастіше аванс складає 50 % суми, але в деяких випадках потрібна повна передоплата."
      },
      {
        "title": "У яких випадках передоплата становить 100 %?",
        "content": "Повна передоплата потрібна у разі замовлення голосового озвучення, а також якщо ви обирете пакет S.O.S для створення музики."
      },
      {
        "title": "Як можна оплатити ваші послуги?",
        "content": "Ми приймаємо оплату за надані послуги тільки на розрахунковий рахунок фізичної особи підприємця (ФОП) або на рахунок Payoneer."
      }
    ]
  },
  "faqSec3": {
    "title": "Юридичні питання",
    "questions": [
      {
        "title": "Чи є у вас договір?",
        "content": "Так, із кожним клієнтом ми укладаємо договір про надання послуг. Він у нас крутий і крафтовий — усе завдяки команді юристів, з якою ми співпрацюємо."
      },
      {
        "title": "Які права на результат я отримаю?",
        "content": "На створені нами звукові ефекти, голосове озвучення та елементи аудіо бренда ми за замовчуванням передаємо вам усі виняткові майнові права інтелектуальної власності, звичайно, з однією умовою — після оплати наших послуг.\n\nНа створені нами музичні композиції ми за замовчуванням передаємо вам майнові права інтелектуальної власності, з обмеженням можливості вільного їх перепродажу й перевипуску, поза обумовленого нами проєкту, а також отримання монетизації зі стрімінгових сервісів і маркетплейсів.\n\nЗа необхідності ми можемо передати вам усі виключні майнові права інтелектуальної власності без будь-яких обмежень, але це слід обговорювати окремо й у такому випадку загальна вартість проєкту буде вище."
      },
      {
        "title": "Чому ви просто не передаєте всі виняткові права на музику?",
        "content": "Іноді саундтреки стають додатковим засобом монетизації проєкту і джерелом надприбутку. Ми вважаємо справедливим, що в подібних випадках композитор має право на додаткову компенсацію."
      }
    ]
  },
  "faqPageContactText": "Не знайшли відповідь на важливе для вас питання? Обов’язково запитайте його в нас — ми будемо раді познайомитися з вами й допомогти."
}
