import React from "react"
import PropTypes from "prop-types"
import Layout from "../../layouts/uk/default"
import { Inner } from "../../components/Container"

import Contacts from "../../components/lendingSections/Contacts"

import mailTo from "../../utils/mailTo"

const PrivacyPolicy = ({ location }) => {
  return (
    <Layout location={location} title="Privacy Policy">
      <Inner>
        <div className="content">
          Публічна оферта Прийнята: 18 листопада 2019 року Оновлена: 18
          листопада 2019 року Вступні положення Вас вітає команда VP Production.
          Ми надаємо послуги зі створення музики, звукових ефектів, аудіо
          брендів, голосового озвучення ігор, фільмів та інших аудіовізуальних
          проєктів. Ми з великою повагою ставимося до Персональних даних всіх
          осіб, які відвідали Сайт, у зв’язку з чим Ми прагнемо захищати
          особисті дані особи, створивши і забезпечивши максимально комфортні та
          безпечні умови використання Сайту кожному Користувачеві. Просимо Вас
          ознайомитися з нашої Політикою Конфіденційності. Це допоможе Вам
          зрозуміти, яку інформацію Ми збираємо, коли Ви користуєтесь Сайтом, як
          її використовуємо та які є методи захисту Ваших Персональних даних.
          Користуючись Сайтом, Ви погоджуєтесь із цією Політикою
          Конфіденційності, методами та способами обробки персональних даних. У
          разі, якщо Ви не згодні з цією Політикою Конфіденційності або
          Правилами Користування Сайтом або їх частиною, будь ласка, припиніть
          використання цього Сайту або відправте Нам листа з Вашими
          пропозиціями. Якщо Ви бажаєте дізнатися, які Ваші Персональні дані Ми
          маємо, або хочете оновити, змінити або видалити свої Персональні дані,
          або якщо Вам стало відомо про випадки несанкціонованого доступу до
          персональних даних третіх осіб, будь ласка, зв'яжіться з нами за
          адресою: connect@vp-production.com. У цій Політиці Конфіденційності
          використовуються наступні терміни: VP Production – ФОП ПЛОТНІКОВ
          ВЛАДИСЛАВ ВОЛОДИМИРОВИЧ, місцезнаходження особи: 65091, Одеса,
          Україна, що є володільцем персональних даних (далі – “Ми”, “Наш”,
          “Нас”, “VP Production”); Користувач – особа, що відвідує та взаємодіє
          з Сайтом (далі – “Ви”, “Ваші”, “Вас”, “Користувач”); Сайт – веб-сайт
          https://vp-production.com[a], весь його контент та посилання.
          Персональні дані – будь-яка інформація, що дає змогу прямо чи
          опосередковано ідентифікувати особу. Яку інформацію Ми збираємо 1.1.
          Ми збираємо наступну інформацію: ту, яку Ви надаєте Нам особисто,
          через форму зв’язку, що зазначається на Сайті (ім'я, за Вашого бажання
          - прізвище, емейл адреса) або в e-mail переписках з Нами; автоматично
          зібрані дані, що збираються та зберігаються сторонніми серверами, а
          саме Mailchimp, Google, Pixel Facebook (дані, такі як кількість
          кліків, тип пристрою, операційна система, тип браузеру та його мови,
          IP-адреса, географічні дані, історія переходів, тривалість з’єднання).
          1.2. Інформація, яку Ви надаєте Нам Коли Ви бажаєте заповнити форму
          для подальшого зв’язку з Вами на Сайті, Ви надаєте повну, точну та
          достовірну особисту інформацію. Надаючи вищезазначену особисту
          інформацію, Ви автоматично дозволяєте Нам зв'язуватися з Вами
          електронною поштою, у тому числі через такі сервіси як Google та
          Mailchimp, Facebook. Ми не зберігаємо Ваші Персональні дані на власних
          серверах. 1.3. Дані, що збираються автоматично Наша веб-аналітика
          виконується за допомогою: Google Analytics, Pixel Facebook. Для
          проведення веб-аналітики збираються такі дані, як мова користування
          Сайтом, демографічні показники, геолокация, вік, стать, джерело
          трафіка, тип пристрою, IP-адреса та інші дані, які використовуються
          сервісами). Мета збору персональних даних Ми збираємо, оброблюємо і
          зберігаємо Ваші персональні дані з метою подальшого зв’язку та
          інформування Вас щодо змін на Сайті та/або Політики Конфіденційності,
          формування бази даних, розсилки маркетингової інформації, отримання
          статистики відвідування Вами Сайту та його окремих розділів, а також
          виявлення різного виду збоїв задля удосконалення функціонування Сайту.
          Як ми захищаємо Персональні дані Ми використовуємо загальноприйняті
          стандарти технологічного та операційного захисту інформації та
          персональних даних від втрати, неправильного використання, зміни або
          знищення. Однак, не дивлячись на всі зусилля, Ми не можемо гарантувати
          абсолютну захищеність від будь-яких загроз, що виникають поза межами
          Нашого регулювання. Ми не продаємо персональні дані третім особам, але
          можемо надавати таку інформацію третім особам у випадках визначених
          п.4 Політики Конфіденційності. Ми також передаємо інформацію стороннім
          ресурсам, таким як Google Analytics, Mailchimp, заздалегідь
          перевіривши їх політики збору та обробки даних, Ви також можете це
          зробити. Розголошення особистої інформації За винятками, встановленим
          п.3 цієї Політики Конфіденційності, Ми не будемо надавати, продавати
          або розповсюджувати Вашу особисту інформацію третім особам. Ми можемо
          розкрити вашу особисту інформацію: нашим співробітникам та професійним
          консультантам; в тому випадку, коли Ми зобов'язані це зробити
          відповідно до закону; в зв'язку з будь-якими поточними або майбутніми
          судовими справами; з метою встановлення, здійснення або захисту Наших
          законних прав (в тому числі надання інформації третім особам в цілях
          запобігання шахрайства). Як довго Ми зберігаємо особисту інформацію
          Персональні дані зберігаються на термін не більше, ніж це необхідно
          відповідно до мети їх обробки, та в жодному разі не більше 7 років.
          Права Користувачів Усі Користувачі мають право: отримувати свої
          Персональні дані, які Ми зберігаємо у структурованому,
          загальновживаному та машиночитаному форматі; обмежити обробку
          Персональних даних; перевіряти точність своїх Персональних даних та
          просити їх оновлення чи виправлення; видалити повністю чи частково
          Персональні дані; відкликати згоду там, де раніше вони дали згоду на
          обробку своїх Персональних даних. Ви можете звернутися до
          connect@vp-production.com, щоб оновити, виправити чи видалити Ваші
          Персональні дані. Вікові обмеження Ми свідомо не збираємо Персональні
          дані дітей віком до 16 років без попередньої згоди батьків. Якщо Ми
          дізнаємося, що Ми зібрали Персональні дані дитини у віці до 16 років
          без попередньої згоди батьків, Ми видалимо такі Персональні дані з
          нашої бази даних якомога швидше. Якщо Ви вважаєте, що Ми могли
          отримати Персональні дані від неповнолітньої дитини, зв'яжіться з нами
          за адресою connect@vp-production.com. Зміни у Політиці
          Конфіденційності Ми можемо на власний розсуд переглядати цю Політику
          Конфіденційності та періодично оновлювати цей документ. Якщо Ми
          вносимо зміни, які суттєво змінюють Ваші права на конфіденційність, Ми
          надамо додаткове повідомлення електронною поштою протягом 30-60
          календарних днів з моменту внесення таких змін та публікації
          актуальної версії на Сайті. Якщо Ви не погоджуєтесь із змінами цієї
          Політики Конфіденційності, вам слід негайно припинити користуватися
          Сайтом. У разі зміни мети, зазначеної у п.2 Політики конфіденційності,
          на нову несумісну з попередньою, Ми запросимо отримання додаткової
          згоди на обробку Ваших персональних даних. Будь ласка, переглядайте цю
          сторінку час від часу, щоб знати актуальну інформацію щодо політики
          збору, обробки Персональних даних. Контактна інформація Якщо у Вас є
          якісь коментарі або питання щодо цієї Політики Конфіденційності, будь
          ласка, зв'яжіться з Нами за електронною за адресою:
          connect@vp-production.com.
        </div>
      </Inner>

      <Contacts>
        Розкажіть нам про свій проєкт, продукт або ідею. Запитайте пораду або
        отримайте повноцінну{" "}
        <a rel="noopener noreferrer" target="_blank" href={mailTo.mail.uk}>
          безплатну консультацію
        </a>
        . Дізнайтеся вартість, уточніть важливе питання, чи, може, ви хочете
        стати частиною нашої команди? Та що завгодно! Ми будемо раді з вами
        познайомитися й допомогти.
      </Contacts>
    </Layout>
  )
}

PrivacyPolicy.propTypes = {
  location: PropTypes.any.isRequired,
}

export default PrivacyPolicy
